ERP.belugaerp/src/Reports/бг_АнализПринимаемыхМарок/бг_АнализПринимаемыхМарок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>бг_АнализПринимаемыхМарок</name>
</mdclass:Report>

ERP.belugaerp/src/Enums/бг_РезультатыПриемкиWMS/бг_РезультатыПриемкиWMS.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>бг_РезультатыПриемкиWMS</name>
  <enumValues>
    <name>ПолноеСоответствиеПлану</name>
  </enumValues>
  <enumValues>
    <name>ЕстьРасхожденияОтПлана</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаОтменена</name>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Documents/ТТНВходящаяЕГАИС/ТТНВходящаяЕГАИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТТНВходящаяЕГАИС</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>InformationRegister.бг_СоставУпаковок</registerRecords>
  <registerRecords>InformationRegister.бг_ДвижениеМарок</registerRecords>
  <attributes>
    <name>бг_ДоверительнаяПриемка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Грузоотправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Грузополучатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДатаРегистрацииДвижений</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаТранспортнойНакладной</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаТТН</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЕстьРасхождения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИдентификаторЕГАИС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НомерТранспортногоСредства</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НомерТранспортнойНакладной</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НомерТТН</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Основание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Перенаправление</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Прицеп</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПунктПогрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПунктРазгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СтатусПроверкиИПодбора</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТипДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТипТранспорта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТоварВПутиПринадлежитГрузополучателю</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТорговыйОбъект</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Упакована</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ФорматОбмена</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Экспедитор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>АлкогольнаяПродукция</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>бг_УпаковкаПаллета</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>бг_ФактическаяКрепость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ИдентификаторУпаковки</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КоличествоФакт</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НомерПартии</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НомерСправки2Поставщика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Справка2</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>17</precision>
            <scale>4</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияСправок2</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Шаг</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>РегистрационныйНомер</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>РегистрационныйНомерПоставщика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ГрузоотправительКод</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ГрузополучательКод</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НомерТТН</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

ERP.belugaerp/src/Reports/бг_АнализПринимаемыхМарок/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	
	Настройки.События.ПередЗагрузкойВариантаНаСервере = Истина;
	
КонецПроцедуры

Процедура ПередЗагрузкойВариантаНаСервере(Форма, НовыеНастройкиКД) Экспорт

	Если Форма.Параметры.Свойство("Документ") Тогда

		НовыеНастройкиКД.ПараметрыДанных.УстановитьЗначениеПараметра(
			Новый ПараметрКомпоновкиДанных("Документ"),
			Форма.Параметры.Документ);

	КонецЕсли;

КонецПроцедуры

#КонецОбласти
	
#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОсновнаяСхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(ОсновнаяСхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	ПараметрДокумент = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(
		Новый ПараметрКомпоновкиДанных("Документ"));
		
	Документ = ПараметрДокумент.Значение;
	
	ПоказыватьРасхождения = ПоказыватьРасхождения(Документ);
	
	// Штрихкоды определяем по ТТН входящей ЕГАИС.
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.битОтражениеФактаПоПриходномуОрдеру") Тогда
		
		ТТНВходящаяЕГАИС = Неопределено;
		ДанныеТТНВходящей = Документы.ТТНВходящаяЕГАИС.бг_ДанныеТТНВходящейПоСвязанномуДокументу(Документ);
		Если ДанныеТТНВходящей <> Неопределено Тогда
			ТТНВходящаяЕГАИС = ДанныеТТНВходящей.Документ;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ТТНВходящаяЕГАИС) Тогда
			ВызватьИсключение НСтр("ru='Не найдена ТТН входящая ЕГАИС'");
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.ТТНВходящаяЕГАИС") Тогда
		
		ТТНВходящаяЕГАИС = Документ;
		
	Иначе
		// NOP
	КонецЕсли;
	
	Если ПоказыватьРасхождения Тогда
		ПринимаемыеМарки = ПринимаемыеМаркиПланФакт(ТТНВходящаяЕГАИС);
	Иначе
		ПринимаемыеМарки = ПринимаемыеМаркиПлан(ТТНВходящаяЕГАИС);
	КонецЕсли;
	
	ВнешниеНаборыДанных = Новый Структура("ПринимаемыеМарки", ПринимаемыеМарки);
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки, Истина);
	
	ДокументРезультат.Очистить();
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПоказыватьРасхождения(Документ)
	
	ПоказыватьРасхождения = Ложь;
	
	АнализируемыеТипыДокументов = Новый Массив;
	АнализируемыеТипыДокументов.Добавить(Тип("ДокументСсылка.ТТНВходящаяЕГАИС"));
	АнализируемыеТипыДокументов.Добавить(Тип("ДокументСсылка.битОтражениеФактаПоПриходномуОрдеру"));
	
	Если Не (АнализируемыеТипыДокументов.Найти(ТипЗнч(Документ)) <> Неопределено И ЗначениеЗаполнено(Документ)) Тогда
		ВызватьИсключение НСтр("ru='Отчет формируется только по заполненному документу ""ТТН входящая ЕГАИС""
		| или ""Отражение факта по приходному ордеру"".'");
	КонецЕсли;
	
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.битОтражениеФактаПоПриходномуОрдеру") Тогда
		
		РезультатПриемки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ, "РезультатПриемки");
		
		ПоказыватьРасхождения = РезультатПриемки = Перечисления.бг_РезультатыПриемкиWMS.ЕстьРасхожденияОтПлана;
		
	ИначеЕсли  ТипЗнч(Документ) = Тип("ДокументСсылка.ТТНВходящаяЕГАИС") Тогда
		
		ЕстьРасхождения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ, "ЕстьРасхождения");
		
		ПоказыватьРасхождения = ЕстьРасхождения;
		
	Иначе
		// NOP
	КонецЕсли;
	
	Возврат ПоказыватьРасхождения;
	
КонецФункции

Функция ПринимаемыеМаркиПлан(ТТНВходящаяЕГАИС)
		
	ПринимаемыеМарки = Документы.ТТНВходящаяЕГАИС.бг_НоваяТаблицаПринимаемыеМаркиПланФакт();
	
	// Получаем данные о штрихкодах.
	ДанныеШтрихкодов = Документы.ТТНВходящаяЕГАИС.бг_ДанныеПринимаемыхШтрихкодовПлан(ТТНВходящаяЕГАИС);
	
	Если ДанныеШтрихкодов = Неопределено Тогда
			
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru='Не найдены плановые принимаемые штрихкоды'"));
			
		Возврат ПринимаемыеМарки;
	КонецЕсли;
	
	// Преобразовываем полученные данные в необходимую для отчета структуру.
	// Для упрощения реализации формируем отчет конкретно под трехуровневую структуру паллетирования.
	ДанныеШтрихкодов.Упаковки.Индексы.Добавить("КодУпаковки");
	
	Для каждого СтрокаМарки Из ДанныеШтрихкодов.Марки Цикл
			
		НоваяСтрокаПринимаемыеМарки = ПринимаемыеМарки.Добавить();
		
		ЗаполнитьЗначенияСвойств(
			НоваяСтрокаПринимаемыеМарки,
			СтрокаМарки,
			"НомерСтрокиТТН, Номенклатура, Серия, АлкогольнаяПродукция, Справка2");
			
		НоваяСтрокаПринимаемыеМарки.КодМарки = СтрокаМарки.ИдентификаторМарки;
		НоваяСтрокаПринимаемыеМарки.КодКоробки = СтрокаМарки.КодУпаковки;
		НоваяСтрокаПринимаемыеМарки.КоличествоПлан = 1;
			
		ПараметрыПоискаПаллеты = Новый Структура("КодУпаковки", СтрокаМарки.КодУпаковки);
		НайденныеСтрокиПаллета = ДанныеШтрихкодов.Упаковки.НайтиСтроки(ПараметрыПоискаПаллеты);
		Если НайденныеСтрокиПаллета.Количество() = 1 Тогда
			НоваяСтрокаПринимаемыеМарки.КодПаллеты = НайденныеСтрокиПаллета[0].КодВышестоящейУпаковки;	
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПринимаемыеМарки;	

КонецФункции

Функция ПринимаемыеМаркиПланФакт(ТТНВходящаяЕГАИС)
	
	Возврат Документы.ТТНВходящаяЕГАИС.бг_ДанныеПринимаемыхШтрихкодовПланФакт(ТТНВходящаяЕГАИС);	

КонецФункции

#КонецОбласти

#КонецЕсли
